app/controllers/accounts_controller.rb

	def create
		@account = Account.new(account_params)
		if @account.valid?
			Apartment::Database.create(@account.subdomain)
---
INSERT INTO "public"."accounts" ("subdomain", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subdomain", "micolbs"], ["owner_id", 1], ["created_at", "2015-08-03 00:44:54.222995"], ["updated_at", "2015-08-03 00:44:54.222995"]]