app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "client", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["client", "Myself"], ["created_at", "2015-08-10 21:37:28.112225"], ["updated_at", "2015-08-10 21:37:28.112225"]]
---
	def create
		@project = Project.new(project_params)
		if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "projects" SET "name" = $1, "client" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["name", "Testh"], ["client", "Myselfh"], ["updated_at", "2015-08-10 21:56:26.873052"], ["id", 1]]
---
	def update
		@project = Project.find(params[:id])

		if @project.update(project_params)